_orgs/2018-09-11-linux-install-note.org
#+startup: showall
#+options: toc:nil
#+begin_export html
---
layout     : post
title      : Linux Install Notes
categories : Linux
tags       : Linux
---
#+end_export
#+TOC: headlines 2

这是我在安装Linux时，做的一些记录，方便自己查看。

关于镜像的制作当时没有记录，只能等下次了。

* Manjaro

** Change Mirrors

   首先当然是切换镜像源。这里选择清华大学镜像源。在shell里做下面这些事情：

   #+BEGIN_SRC shell
     sudo pacman-mirrors -i -c China -m rank
     # - Select mirror
     sudo vim /etc/pacman.conf
     # － Add sth.
     # [archlinuxcn]
     # SigLevel = Optional TrustedOnly
     # Server = https://mirrors.tuna.tsinghua.edu.cn/archlinuxcn/$arch
     # :wq
     sudo pacman -Syy
     sudo pacman -S archlinux-keyring
     yaourt -Syua
     sudo vim /etc/yaourtrc
     # Add sth.
     # AURURL="https://aur.tuna.tsinghua.edu.cn"
     # :wq
   #+END_SRC

   然后安装你需要的东西。

* Arch

  关于arch的安装其实 [[https://wiki.archlinux.org/index.php/Installation_guide][arch wiki]] 真的是相当详细了，具体操作参考 wiki。
   1. 连接wifi，设置时区
      #+BEGIN_SRC shell
        # - connect wifi or use netctl
        wifi-menu
        # - Update the system clock
        timedatectl set-ntp true
        systemctl enable --now systemd-timesyncd.service
      #+END_SRC

   2. 分区
      #+BEGIN_SRC shell
        # - List disk information
        fdisk
        # - partition the disk Note:o->mbr p->gpt
        fdisk /dev/sda
        # - format
        mkfs.ext4 /dev/sda1
        # - mount
        mount /dev/sda1 /mnt
      #+END_SRC

   3. 更换镜像源并安装
      #+BEGIN_SRC shell
        # - Use s-* to find tuna, dd to cut this line, yy pasete at first line.
        vim /etc/pacman.d/mirrorlist
        # :wq
        # - Install arch
        pacstrap /mnt base base-devel
      #+END_SRC

   4. 基础配置
      #+BEGIN_SRC shell
        # - Fstab file
        genfstab -L /mnt >> /mnt/etc/fstab
        # - Check fstab file
        cat /mnt/etc/fstab
        # - Change root
        arch-chroot /mnt
        # - Set Timezone
        ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime
        hwclock --systohc
        # - Install basic tools
        pacman -S vim dialog wpa_supplicant ntfs-3g networkmanager netctl wireless_tools wpa_actiond
        # - Set locale
        vim /etc/locale.gen
        # - Add this(with out #) in locale.gen
        # en_US.UTF-8 UTF-8
        # zh_CN.UTF-8 UTF-8
        # :wq
        locale-gen
        vim /etc/locale.conf
        # - Add this in locale.conf
        # LANG=en_US.UTF-8
        # :wq
        vim /etc/hostname
        # - Add this in hostname
        # 400dama
        # :wq
        # - Set root password
        passwd
        # - Install and set grub
        pacman -S intel-ucode os-prober grub
        grub-install --target=i386-pc /dev/sdx
        grub-mkconfig -o /boot/grub/grub.cfg
        # - If failed to connect to lvmetad
        vim /etc/lvm/lvm.conf
        # use_lvmetad = 0
        # :wq
        exit
        reboot
      #+END_SRC

   5. 个人设置
      #+BEGIN_SRC shell
        # - Add user
        useradd -m -G wheel username
        passwd username
        pacman -S sudo
        visudo
        # %wheel ALL=(ALL)ALL
        # - Auto connect you wifi
        ls /etc/netctl/
        # - xxxxx is a file when you connect with wifi-menu auto generated.
        sudo cat /etc/netctl/xxxxx
        systemctl start netctl-auto@vvv.service
        systemctl enable netctl-auto@vvv.service
      #+END_SRC

* Comman
   1. 左ctrl和Caps交换
      再买把HHKB不就好了！
      +#+BEGIN_SRC shell+
        +sudo vim /etc/profile+
        +# Add this in the file+
        +# setxkbmap -option ctrl:swapcaps+
        +# :wq+
      +#+END_SRC+

   3. 安装小鹤双拼
      #+BEGIN_SRC shell
        # - Install Chinese Language Packages At First
        sudo pacman -S fcitx-rime fcitx-im fcitx-configtool fcitx-skin-material
        # add blow to .xprofile or ./xinitrc
        export GTK_IM_MODULE=fcitx
        export QT_IM_MODULE=fcitx
        export XMODIFIERS=@im=fcitx
        # Install xiaohe
        git clone https://gitee.com/BugaoSion/rime-xhup.git ~/rime-xhup
        cp ~/rime-xhup/xhup.schema.yaml ~/.config/fcitx/rime/xhup.schema.yaml
        cp ~/rime-xhup/xhup.dict.yaml ~/.config/fcitx/rime/xhup.dict.yaml
        # Add xhup to schema_list
        sudo emacs ~/.config/fcitx/rime/build/default.yaml
      #+END_SRC

   4. LaTex
      #+BEGIN_SRC shell
        sudo pacman -S texlive-most
      #+END_SRC

到这里就差不多了。

#+BEGIN_QUOTE
AUTHOR:  400dama

LINK:    https://400dama.xyz/2018/09/11/linux-install-note.html

LICENSE: 本博客所有文章除特别声明外，均采用 [[https://creativecommons.org/licenses/by-nc/4.0/][CC BY-NC 4.0]] 许可协议。转载请注明出处！
#+END_QUOTE
